Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: “这倒是个办法。”麦格点头，这是双人座的摩托，安妮坐上倒是刚好合适，但伸手拔掉了车钥匙，道：“白天路上人多，不适合开出去，等晚上路上没人了，再开出去溜达吧。”
en_us: "This is a way." Mag nodded. This is a double-seater so it's suitable for Annie. However, he reached over and pulled the key out, saying, "There are many people on the streets in the day. It's not safe for you to drive out. You can go again at night when there aren't anyone in the streets."

source: “这倒没错，你是真的废。”麦格点点头，被猪队友害了的典型例子。
en_us: "That's true. You are really useless." Mag nodded. This was the prime example of being dragged down by a burden teammate.

source: “这助攻，专业啊。”麦格看着手中刚刚拿到的公开信，有些惊讶。
en_us: "This secondary attack was professionally done." Mag looked at the open letter that he had just received with surprise.

source: “这又是什么酒？”库尔特顿时来了兴致，能够与茅台酒卖出相同的价格，莫非品质相当？
en_us: "What kind of alcoholic beverage is this?" Kurt's interest was piped instantly. It was priced the same as Maotai, perhaps its quality was comparable to it too?

source: “这口感！这味道！怎么可以这么好吃！”
en_us: "This texture! This taste! How can it be so delicious!"

source: “这只丑小鸭看起来像是中暑了，要不……”
en_us: "This Ugly Duckling seems to have suffered a heat stroke, why don't…"

source: “这可使不得，老爷听说您昨晚没有收钱已是训斥了老奴一顿，要是再让他知道我们在外面白拿，回去可得把老奴赶走。”老管家取出一枚银币交给麦格，“您且收着，老爷喜欢您做的菜，以后定然还会再来的。”
en_us: "There's no need for that. Master has already scolded me for not paying you last night. If he knew that I was taking things for free out here, he would chase me out when I returned." The old butler gave one silver coin to Mag. "Please keep this. Master loves your dishes. He will definitely return again."

source: “这可是刚刚拿了金奖的酒，还是马库斯大师当年亲手酿制，窖藏三十年的泰坦酒。
en_us: "This is the Titan Liquor that just has gotten the gold award, personally brewed Master Marcus back then and aged for 30 years in a cellar.

source: “这可是国宝，是你们随便能养的吗？”麦格在心里笑道，他也不清楚这个世界到底有没有熊猫，所以不好直接说死，只说是从一个猎户那里买来的，他也不知道这是什么东西。
en_us: This is a national treasure. Do you think you can keep it as a pet? Mag chuckled inwardly. He didn't know if pandas existed in this world, so he couldn't give a definite answer. He only said that he bought it from a hunter, and had no idea what it was, either.

source: “这可真是一个闲的蛋疼的系统。”麦格在心里吐槽了一句，然后在心里问道：“系统，我要订购一个法国蜗牛。”
en_us: "It is really a bothersome system." Mag complained inwardly before asking, "System, I want to order French escargots."

source: “这可真是一口好井，就像一个许愿池一样呢。”艾米把可乐盖上盖子，开心的说道。
en_us: "This is a good well. It's just like a wishing pond." Amy capped the bottle and said happily.

source: “这可真是便宜你了。”卖家一脸肉疼的拿着银票走了，要不是眼见罗莫街要彻底落寞了，一天连鬼影都看不到几个，他又怎么舍得亏本一百万把房子给卖了。
en_us: "You really got yourself a bargain." The seller walked away with a banknote with a pained expression. If he hadn't seen that Romo Street had been going into a decline completely, and nobody had been coming at all, he wouldn't have sold the property while making a loss of 1,000,000.

source: “这可真是看谁，谁怀孕的神技啊。”麦格捏起那片铁片，啧啧称奇。
en_us: Mag picked up that piece of metal and said in amazement, "This is one amazing technique."

source: “这台阶做的是挺平整的，我把门缝给你留大一点吧。”麦格宽厚一笑，然后把门打开了一条缝，丝丝暖气从酒馆里吹拂出来。
en_us: "This step is rather flat. I'll leave the door ajar for you." Mag smiled generously. After that, he left the door slightly open so that the warm air from the tavern would blow out.

source: “这命令是谁下的？要是陛下下的，他又怎么会被抓起来？”麦格接着问道。
en_us: "Who gave the order? If it was the king, why was he arrested?" Mag continued asking.

source: “这块留影石里的内容足够让各族深刻考虑现状了，而洛斯帝国加入和平联盟，也意味着战争联盟失去主心骨，已经不足为虑。”迈克尔摇摇头，放下手中的承诺书，看着麦格道：“亚历克斯，诺兰大陆的居民都应该感谢你们。”
en_us: "The content in this photostone is enough to let all the races consider their current situation and the Roth Empire joining the Peace Alliance meant that the pro-war alliance has lost their main support and is longer a threat." Michael shook his head. He put down the letter of commitment in his hands and said to Mag, "Alex, the people of the Norland Continent should thank you guys."

source: “这大概就是蟹黄灌汤包的巅峰了吧。”麦格忍不住在心中赞叹，不愧是让他折戟无数次的灌汤包。
en_us: "This is probably the peak of the crab roe soup dumpling,{" Mag could not help but praise himself. It was indeed the soup dumpling that he had failed countless of times for.

source: “这套设备老化太严重了，而且本身的产出效率很低，你的使用方法也有问题，蒸馏酒的精华便在那云雾之中，你却让他们白白逃走了，所以酿出来的酒才会味淡如水。”麦格看着埃菲，道：“如果我没有猜错的话，你酿酒的产出率极低，所以在调配的时候只能增加水的用量，进一步拉低了酒的品质。”
en_us: "This set of equipment is too old and its productivity is already low to begin with. There is also something wrong with the way you use it. The essence of the distilled spirits is in that steam, and yet you let them escape. That's why the liquor you brewed is tasteless like water." Mag looked at Eiffie and said, "If I have guessed correctly, your distillation output is extremely low, so you have to increase the water usage during the mixing and that further decreases the liquor's quality."

source: “这娘俩简直一个模子里刻出来的。”麦格看着正在开心的清点着那座金山的伊琳娜，表情有点无奈。
en_us: "Chip off the old block," Mag said with a resigned expression as he watched Irina count the amount of the mountain of gold happily.

source: “这学习周期还不短。”麦格点点头。
en_us: "Your learning period isn't short at all." Mag nodded.

source: “这孩子，怎么就这么傻呢……”泪光在亚伯罕的眼中闪烁，几个小家伙年幼时的模样仿佛还在眼前。
en_us: "This child. How could he be so foolish…" Tears welled up in Abraham's eyes. It was as though he could see the little fellows when they were still children right before his eyes.

source: “这完全不用担心，这些人就算学会了怎么做这些菜，也绝不可能做出和麦老板一样品质的食物。”墨白笑着摇摇头，“就像大家都是锻造武器的，我就算再打一百年，也不肯比得上罗姆大师。而那些在罗姆大师那里求武器的人，也不会到我的铁匠铺来让我给他们锻造武器。”
en_us: "Nothing to worry about. These people can learn how the dishes were made, but they can never recreate the quality of Boss Mag's food." Mobai shook his head with a smile. "It's just like how everyone can forge weapons, but even if I did that for another century, I would never be better than Master Rom at it, and those who want a weapon from Master Rom would never come to my blacksmith shop to ask me to make them a weapon."

source: “这家伙……还真是一个奇怪的人呢？”泰坦酒馆门口，埃菲蹙着眉，有些迷惑。
en_us: That fellow… is rather strange? The door to Titan Tavern opened. Eiffie frowned and was puzzled.

source: “这家酒馆当初生意也是极好的，不过老板家里出事，无力继续经营，所以忍痛转让，您要是要的话，可以直接买走，稍微休整一下，生意绝对爆好。”费奇掏出钥匙一边开门一边说道，罗莫街已经很久没有转租和出售成功的店铺了，最近越来越多的商户撤离这里，愈发萧条，他也只是努力尝试一下。
en_us: "Business was excellent for this tavern, but something happened to the boss at home, and he couldn't carry on with the business, so he had to give up the tavern. If you want, you can simply buy it right away and do a simple renovation. Your business will definitely thrive." As Fitch spoke, he took out the key, and opened the door. It had been a long time since a shop had been rented or sold on Romo Street. More and more businesses had moved out from here, and Romo Street became more and more quiet. He was simply trying to promote it to Mag.

source: “这家酒馆竟然还在。”波比有些意外，不过看到招牌后，他又恍然，“原来已经换了老板。”
en_us: I can't believe this tavern is still around. Bobby was rather surprised. However, after looking at the signboard, he understood. The owner has changed.

source: “这家餐厅，一直都有那么多客人吗？”排队一个小时后，还没有轮到进场的希利终于还是忍不住问道。
en_us: After lining up for one hour, Seely finally couldn't help but ask, "Does this restaurant always have so many customers?"

source: “这小姑娘是想一个圈子消灭一只大肥鹅吗？”
en_us: "This little girl wants to win one goose with each ring?"

source: “这就对了，乖。”艾米脸上重新露出了笑容。
en_us: "That's it. Good." Amy smiled.

source: “这就方便了。”诺亚恍然。
en_us: "That's convenient," Noya exclaimed.

source: “这就是你扶着腰从泰坦酒馆里出来的理由？”伊琳娜双手抱胸，审视着靠墙站着的麦格。
en_us: "This is the reason why you came out of Titan Tavern with a hand on your back?" Irina crossed her arms, leaned against the wall and looked at Mag judgingly.

source: “这就是克苏鲁赋予你的能力吗？”晞看着麦格的眼睛问道。
en_us: Xi looked into Mag's eyes and asked, "Is this the power that Cthulhu gave to you?"

source: “这就是克苏鲁，来自地狱的魔鬼，从黄金龙岛之下脱离了封印，一个杀不死的怪物。”麦格平静的介绍道。
en_us: "This is Cthulhu, a Devil from hell. It is a monster that had escaped the seal at the Golden Dragon Island and cannot be killed," Mag introduced calmly.

source: “这就是蛋黄酥了，不过要稍微凉一会才能吃。”麦格笑着端着蛋黄酥走了出来。
en_us: "This is the salted egg yolk pastry, but you can only eat it after it cools down." Mag walked out with the salted egg yolk pastry smilingly.

source: “这局势真的会恶化吗？”迈洛又小声问道，这两天洛都百姓也是有点不安，经历了长久的和平，虽然洛斯帝国现在已经非常强大，可一提到战争，依旧让人发憷。
en_us: "Is the situation really going to deteriorate?" Mylo asked softly again. The people in Rodu felt a little uneasy too. After experiencing a long period of peace, although the Roth Empire was very powerful now, people were still afraid whenever war was mentioned.

source: “这已经相当厉害了。”诺亚点头。
en_us: "This is already very impressive." Noya nodded.

source: “这应该是粮食酒，用的是和泰坦酒类似的酿造方法，酒香馥郁，酱香、窖藏的香味，还有着淡淡的醇甜混合在一起，香味极为独特。”库尔特用手扇着酒香点评道，然后抿了一口酒。
en_us: "This should be a grain alcohol. It's brewed similarly to Titan Liquor. Its aroma is rich, with a hint of sauce and cellar-aged. There is also a faint sweet scent in it. Its aroma is very unique." Kurt fanned the aroma with his hand and commented before taking a sip of it.

source: “这店铺的风格，倒是有些复古啊。”库尔特走进酒馆，先打量了一下酒馆的环境，没有金碧辉煌的装饰和灯光，以古朴大气的原木和深色调为主，让人觉得温馨舒适。
en_us: "This shop's renovation style is rather vintage-looking." Kurt entered the tavern and sized up the tavern's environment. There was no glamorous decoration and lighting. The down-to-earth wood and dark colors were the main tone. It made people feel comfortable and cosy.

source: “这当然是美食杂志，我们的男神就是一位超厉害的厨师，他曾经获得了国王陛下寿诞的第一厨师称号，却拒绝留在御膳房，他创造的鱼香茄子让素食主义创造了创刊以来的单期发行纪录，他创造的……”那姑娘如数家珍。
en_us: "Of course this is a gourmet magazine. Our idol is a super formidable chef. He has once received the number one chef's title from the king on his birthday's feast, but he refused to stay in the royal kitchen. The eggplant with garlic sauce that he created made the Vegetarianism break its highest sales record ever. He created…" That young lady was very familiar with Mag's achievements.

source: “这怎么好呢，毕竟哈迪斯先生也是有家室的人了，而且还有你这样美丽的夫人和可爱的女儿。”埃菲撩了一下头发，微微摇头道。
en_us: Eiffie flicked her hair, shook her head and said, "How can I do that? Mr. Hades is a married man with children after all. Moreover, he has a beautiful wife like you and adorable daughters."

source: “这怎么算？！”
en_us: "How is the boss going to count that?!"

source: “这手段可真是先进啊。”麦格都忍不住赞叹。
en_us: "That is a very advanced skill." Mag could not help but praise it.

source: “这旧日支配者就算真的闲得慌，也不至于偷你一个温度计吧？”麦格还是有点不信。
en_us: "Even if the Great Old Ones had nothign to do, they wouldn't steal your thermometer, right?" Mag was still in disbelief.

source: “这是……怎么回事？”梅兰特也是坐起身来，拍了拍有些昏沉的脑袋。
en_us: "W-what's going on?" Merante also sat up and slapped his groggy head.

source: “这是……！”莎莉表情剧变。
en_us: "This is...!" Sally's face was tight with shock.

source: “这是一个危险的世界，但危险中充满了机遇。”
en_us: "This is a dangerous world, but there are plenty of opportunities amidst the danger."

source: “这是一个简易的单向传送阵，可以用来传送一些物品，之后的饭菜我都会通过这个传送阵送到你们这里，避免过多来往引起不必要的关注。”麦格摆弄好那传送阵，笑着解释道。
en_us: "This is a simple one-way teleportation portal. It can be used to teleport some items. I will be delivering the food through this teleportation portal from now on to avoid attracting too much attention by coming over frequently," Mag explained with a smile as he finished up with the portal.

source: “这是一件必定被载入史册的事件，你开启了一个新的和平世纪。”迈克尔看着手中的承诺书，一脸感慨道。
en_us: Michael looked at the letter of commitment in his hands and lamented, "This is an event that was going to be written into the history books. You have started a new century of peace."

source: “这是一位受害者的一缕残魂，里面充斥着怨念，这样能够溯源追踪，在检测范围内锁定这个黑衣人。”梅兰特解释道。
en_us: "This is a soul fragment from one of the victims. It is filled with resentment, which will allow us to trace the evil aura back to the origin and lock our search boundaries on the man in black," Merante explained.

source: “这是一场足以席卷诺兰大陆的劫难，我们巨龙族也无法独善其身。”道格拉斯看着画面最终定格的恐怖不可名状物，心情十分沉重。
en_us: "This is a catastrope that can sweep through the Norland Continent. We, the giant dragons, have no way to stay out of it." Douglas looked at the image that was paused on that indescribable thing and felt very heavy hearted.

source: “这是一家新酒馆吧？之前没听说过，莫非是想要用酒香来吸引客人？”
en_us: "This is a new tavern, right? I have never heard of it before. Perhaps it's trying to seduce its customers with the liquor's aroma?"

source: “这是一家有个好厨子，还有个好酿酒师的酒馆。”那位老大人抿了一小口酒，美滋滋的咂了咂嘴赞叹道。
en_us: "This is a tavern with a good chef and good brewer." That old courtier took a sip of the fine wine, and smacked his lips in satisfaction.

source: “这是一瓶非常不错的美酒，如果埃菲小姐拿这瓶酒去参加品酒大会的话，不出意外应该能够获得一个不错的名次。”麦格指着埃菲手里那瓶酒说道。
en_us: "This is a bottle of good wine. If Miss Eiffie were to attend the liquor tasting event with this bottle of wine, I think you could win with a rather good standing," Miss said as he pointed to the bottle of wine in Eiffie's arms.

source: “这是个陷阱。”
en_us: "This is a trap."

source: “这是之前买的，但我和玛拉两个人也用不上那么多，但给哈迪斯先生你们一家人用就刚好合适呢。”埃菲笑着将厨具递给麦格。
en_us: "I bought this before today, but Mala and I didn't need to use so many of them, so they are perfect for Mr. Hades and your family." Eiffie passed the kitchenware to Mag smilingly.

source: “这是二十五万定金，还有交货地址和时间，我们会通知雇主，不过不能确保你能够拿到剩下的佣金。”从黑色孔洞中递出了一个黑色的钱袋和一张纸。
en_us: "This is the deposit of 250,000 and the time and location of the transaction. We will inform the owner. However, we cannot guarantee that you will be able to receive the rest of your reward." a black money pouch and a piece of paper appeared from the black hole.

source: “这是什么东西？”伊琳娜一边给麦格施展治疗术，一边问道。
en_us: "What's this?" Irina asked as she used healing magic on Mag.

source: “这是什么宠物，我也想养一个。”
en_us: "What pet is this? I want to have one too."

source: “这是什么宠物？是魔兽吗？”温妮莎好奇的问道，实在太可爱了，就像小老板的那只叫丑小鸭的猫咪一样，要是能养一只就好了。
en_us: "What pet is this? Is it a magic beast?" Vanessa asked curiously. It was too cute, and was just like the kitty that the little boss had called Ugly Duckling. If only she could have one as a pet.

source: “这是什么操作？怎么把酒给锁起来了？”
en_us: "What is this? Why is the liquor locked up?"

source: “这是什么酒？酒香怎么会如此醇香馥郁。”本来打算下台的库尔特一下子抬起头来，看着正在倒酒的工作人员，表情有些惊讶。
en_us: "What liquor is this? Why is its liquor's aroma so rich and fragrant?" Kurt, who was about to go down the stage, looked up immediately at the staff member who was pouring the liquor with a shocked expression.

source: “这是什么香味？”亚伯罕的鼻翼动了动，有些讶异的掀起一角车帘，一股酒香铺面而来，而塞班酒馆四个大字也是映入他的眼帘。
en_us: "What fragrance is that?" Abraham's nostrils flared, and he lifted the carriage's curtains in surprise. A whiff of liquor's aroma washed over him, and the words "Saipan Tavern" appeared in his line of vision.

source: “这是什么魔兽？我怎么没有见过。”伊琳娜也是有些好奇。
en_us: "What magic beast is this? Why have I never seen it before?" Irina was also rather curious.

source: “这是什么？”
en_us: "What's that?"

source: “这是他们不小心遗留下的食物吗？”
en_us: "Did they leave this food behind by accident?"

source: “这是你父亲留给你的财富，不是让你将他们全部留在酒窖中怀念的，而是应该让他们继续在酒的江湖中叱咤风云，就像当年你父亲做的那样。”麦格扯开门上挂着的老旧锁，轻轻推开了酒窖的大门。
en_us: "This is the wealth that your father left for you. He didn't mean for you to keep them all in the cellars to reminisce about him. Instead, you should continue to let them rule the world of liquor, just like what your father did before." Mag tore away the old lock on the door and gently pushed open the cellar's doors.

source: “这是公主殿下的命令吗？”艾许莉接过图纸，看着麦格问道。
en_us: Ashley took the blueprints and asked, "Is this the princess' order?"

source: “这是兵部一位官员的府邸，据说府中上下一百二十多人全部死了，只剩下被关押在天牢的那位官员，昨晚听说这件事后也撞墙自杀了。”麦格等人在一处屋顶上看着不远处那被烧成一片焦土的大庭院。
en_us: "This is the mansion of one of the military generals. I heard that all 100 to 200 of them died, leaving only the general locked up in prison. Last night, after hearing about this incident, he knocked his head on the wall and died." Mag and the rest stood on a rooftop as they looked out at a distant large courtyard that had been burnt to the ground.

source: “这是哪家酒馆偷偷研发的吗？鲍里斯那么淡定，会不会是里斯酒馆偷偷研发的？”
en_us: "Which tavern comes up with this secretly? Boris looks so calm. Could it be Reese Tavern who comes up with it?"

source: “这是失败品？”
en_us: "Is this a failure?"

source: “这是屋主要求的价格，我们也无权更改。”费奇苦笑，这高于市场价一倍的租金，先前他就和麦格提过了，但他坚持这个价格。
en_us: "This is the price that the owner asked for. We have no right to change it either." Fitch laughed awkwardly. He had already told Mag that the price was double that of the market price, but Mag insisted on it.

source: “这是彩虹炒饭哦，不过今天乌云太多了，所以就变黑了。”艾米笑眯眯的介绍道。
en_us: Amy smilingly introduced, "This is the rainbow fried rice, but there were too many dark clouds today, so it became black."

source: “这是怎么做到的？”波比一脸不可思议。
en_us: How was that done? Bobby was astonished.

source: “这是恐怖猎手，克苏鲁的仆从种族之一。”晞开口道：“你是如何找到它的？”
en_us: "This is a horror hunter, one of Cthulhu's servant races," Xi said, " How did you find it?"

source: “这是我三岁的时候就能做的事情了。”艾米撇撇嘴，一脸认真的纠正道：“而且，我现在四岁了，不是三岁半！”
en_us: "This is what I could already do at three years old." Amy pursed her lips and corrected with a serious expression, "Moreover, I'm four years old now, not three and a half!"

source: “这是我们今日在洛斯帝国极北雪原之上经历的事情，国王可以先看看。”麦格取出了一枚留影石。
en_us: "This was what we experienced today at the Roth Empire's snowy plain in the extreme north of the Roth Empire. Your Majesty, please take a look." Mag pulled out a photostone.

source: “这是我们泰坦酒馆的招牌泰坦酒，您尝尝。”埃菲把酒杯放到麦格面前。
en_us: "This is the signature wine of Titan Tavern. Have a try." Eiffie placed the glass of wine in front of Mag.

source: “这是我做的一些绿豆糕，你们吃一点吧，下面还有两份炒饭，就当做晚餐了。”麦格放下食盒，又在房间的角落里画了个圈，放下一个圆盘。
en_us: "I made some mung bean pastries. Have some. There are two helpings of fried rice too. Take this as your dinner." Mag placed the lunch boxes down, and drew a circle at the corner of the room after that. He placed a circular dish down.

source: “这是我女儿安妮，她不会说话，但很喜欢画画，也很可爱，是吧。”麦格微笑着介绍道，自然的走到她的身旁，身体微侧，确保自己能够在第一时间对晞的行为作出应对。
en_us: "This is my daughter, Annie. She can't speak, but she loves to draw. She's very cute, right?" Mag introduced Annie with a smile and walked next to her. He leaned towads Annie, making sure that he could react instantly to Xi's actions.

source: “这是我昨天酿的，你拿回去尝尝，加了基酒调配，算是三年份的朗姆酒。”汉娜把酒递给麦格，然后说道。
en_us: Hannah passed the rum to Mag, and said, "I brewed them yesterday. Take them back and try them. I made them with base liquor, so it can be considered as three years old rum."

source: “这是我父亲酿的酒，三十多年前酿的。”埃菲平静的说道。
en_us: "This is the wine my father brewed more than 30 years ago," Eiffie said calmly.

source: “这是我的事，我不需要他为我做什么，虽然他已经做的足够多。”伊琳娜平静道。
en_us: "This is my matter. I don't need him to do anything for me, even though he has already done a lot," Irina answered calmly.

source: “这是我的妻子，一个应该知晓这件事，并能够保守秘密的人。”麦格介绍道。
en_us: "This is my wife. She's someone who should know about this and she can keep a secret." Mag introduced her.

source: “这是打架去了？”麦格看着依旧昏迷不醒的伊琳娜，在心中道：“系统，帮我给她检查一下，是否受伤，是否有生命危险？”
en_us: Did she go fighting? Mag looked at Irina, who was still unconscious, and asked inwardly, "System, help me give her a checkup. Is she injured? Is her life in danger?"

source: “这是文艺作品，让美丽的美人鱼小姐啃泥壳……未免有些不太雅观。”麦格摇头。
en_us: "This is an artistic work. Making the beautiful mermaid munch on mud casing… doesn't seem too elegant." Mag shook his head.

source: “这是昨天才刚刚出现在黑市上的任务，要求是劫走泰坦酒馆的老板，然后一把火烧了酒窖和酒馆，佣金一百万铜币。
en_us: "This was a mission that just came out on the black market yesterday. The requirement was to rob the owner of Titan Tavern and then burn down the cellar and tavern. The reward is 1 million copper coins.

source: “这是水蜗牛吗？”伊琳娜端着水杯站在一旁，看着麦格面前盆里的田螺，也是好奇的问道。
en_us: Irina stood at the side with a glass of water as she looked at the escargots in the basin in front of Mag and curiously asked, "Are these the water snails?"

source: “这是熊猫，不是魔兽，只是一种靠卖萌为生的动物。”艾米摇摇头。
en_us: "This is a panda. It is not a magic beast. It is an animal that sustains a living through acting cute." Amy shook her head.

source: “这是牛蜗，肉质酸腐，而且有毒，不能吃。”伊琳娜不知何时出现在门口，有些慵懒的倚着门框，看着艾米手里的蜗牛说道。
en_us: Irina suddenly appeared at the door. Leaning against the door frame, she looked at the snail in Amy's hand and lazily said, "This is the cow snail. Its meat is acidic and corrosive, and it's poisonous. It's not edible."

source: “这是田螺，一种食材。”麦格笑着介绍到，顺手拿起一个递给艾米。
en_us: "This is escargot. It's an ingredient," Mag introduced with a smile and passed one to Amy.

source: “这是田螺，不是蜗牛。”麦格纠正道，见众人都望着自己，想到他们都是第一次吃这道菜，又介绍道：“田螺吃的是螺肉，而螺肉藏在这坚硬的外壳之中，我们要把它吸出来才行。”
en_us: "This is an escargot, not a snail," Mag corrected. When he saw that everyone was looking at him, he recalled that this was their first time trying this dish so he introduced, "When you eat an escargot, what you're eating is its meat. The meat of the escargot is hidden within it's hard shell. We have to suck it out."

source: “这是红油抄手，今天第一次试做，你们要不要尝尝？”麦格笑着道。
en_us: "This is Sichuan spicy wontons in red oil. Today is my attempt at making it. Do you guys want to try it?" Mag smilingly said.

source: “这是茅台酒，是我品尝过的最美味的酒。”波比拿起一瓶茅台，熟练的打开瓶盖。
en_us: "This is Maotai, the most scrumptious liquor I have ever tasted." Bobby picked up a bottle of Maotai, and twisted the cap open familiarly.

source: “这是谣言。”麦格摇头。
en_us: "This is a rumor." Mag shook his head.

source: “这是那艘飞船的最新坐标信息。”麦格的脑海中出现了一个立体坐标图。
en_us: "This is the latest details on the location of the spaceship." A 3D map appeared in Mag's mind.

source: “这是里斯酒馆的爆炸酒吧，口感依旧如名字一般炸裂，一入口便给人带来惊喜，令人印象深刻，而且今年的酒味还有了一些改进，入喉之后变得更为柔顺，挺让人惊喜的。”弗格斯放下酒杯，笑着点评道。
en_us: "This is Reese Tavern's Explosive Liquor. The texture is just as the name described, explosive. It surprises one instantly when it enters the mouth and made a strong impression. Furthermore, there is some improvement to the taste this year. It became smoother after going down the throat. It's rather surprising." Fergus put his glass and commented with a smile.

source: “这是饿了？”麦格挑眉，一时间竟是无法判断这是艾米自己的主意，还是系统任务。
en_us: "So, she's hungry?" Mag raised his eyebrows. He couldn't decide at if that was Amy's idea or the system's mission.

source: “这是？”
en_us: "This is?"

source: “这是？”诺亚看着那圆盘有些不解地问道。
en_us: "This is?" Noya asked in bewilderment as he looked at the circular dish.

source: “这是？”麦格皱眉，觉得后背有些发凉。
en_us: "This is?" Mag frowned, feeling a chill up his back.

source: “这是？！”
en_us: "This is?!"

source: “这机器真的超级好用啊，输出超稳定，我用一天时间就把他整明白了，比我当初那堆破烂好用太多了。”汉娜毫不掩饰对新机器的喜爱，“我现在已经把我和我爷爷的几个朗姆酒配方调试出来了，新机器酿造出来的成品质量更好，而且能够保证品质，坏酒率极低。
en_us: "The machines are super useful. Their output is so stable. I figured them out within one day. They are much easier to use than my previous rubbish." Hannah didn't conceal her love for the new machinery. "I have already debugged a few of my and my grandpa's rum formulae. The quality produced by the machines is even better. Furthermore, the quality is guaranteed. The probability of having a bad batch of rum is extremely low.

source: “这条街一半房子是我的，一会你们随便选一栋住都行。”麦格批了一件大衣，向着门口走去，一边淡定道。
en_us: "Half of the houses on this street belong to me. You can choose a random house later," Mag said calmly as he put on his coat, and walked to the door.

source: “这果酒口感尚可，甜味稍重，还有进步空间。”库尔特简短点评，拿起面前的分数牌。
en_us: "This ratafia's texture is still alright. It's a little too sweet. It still has room for improvement." Kurt gave a short review before raising the score card in front of him.

source: “这栋楼的面积有多大，年租金是多少？”矮胖的那位问道。
en_us: "How big is this property? How much is its annual rental?" The short and fat man asked.

source: “这样……应该就不会伤了她的自尊心了吧？”伊琳娜往门口瞄了一眼，笑着道。
en_us: Irina peeped at the entrance and smilingly said, "We…shouldn't have hurt her pride, right?"

source: “这样啊……”
en_us: "I see..."

source: “这样啊……”埃菲表情略有尴尬，心里又是有点自责，没想到因为自己，哈迪斯先生还在家里受了这样的委屈。
en_us: "I see..." Eiffie had an awkward expression and she was feeling a little self-reproachful. She didn't expect Mr. Hades to suffer at home because of her.

source: “这样啊……”艾米点点头，又是好奇的问道：“那什么蜗牛是可以吃的呢？”
en_us: "I see..." Amy nodded. She asked again cusiously, "In that case, which snails can be eaten?"

source: “这样啊……”艾米若有所思的点点头，咬了一口包子，又是有些苦恼：“那我要去哪里找可以食用的蜗牛呢？”
en_us: "I see..." Amy nodded thoughtfully and took a bite of the bun. Feeling rather bothered, Amy said, "Then, where can I find edible snails?"
